In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('../../data/tips.csv')
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

# Conditions

In [4]:
bool_series = df['total_bill'] < 15
df[bool_series]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546
14,14.83,3.02,Female,No,Sun,Dinner,2,7.42,Vanessa Jones,30016702287574,Sun3848
...,...,...,...,...,...,...,...,...,...,...,...
228,13.28,2.72,Male,No,Sat,Dinner,2,6.64,Glenn Jones,502061651712,Sat2937
232,11.61,3.39,Male,No,Sat,Dinner,2,5.80,James Taylor,6011482917327995,Sat2124
233,10.77,1.47,Male,No,Sat,Dinner,2,5.38,Paul Novak,6011698897610858,Sat1467
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032

In [5]:
#df[df['tip'] > 5]

In [6]:
df[df['sex'] == 'Male'][['Payer Name','CC Number']]

             Payer Name         CC Number
1        Douglas Tucker  4478071379779230
2        Travis Walters  6011812112971322
3      Nathaniel Harris  4676137647685994
5            Erik Smith   213140353657882
6    Kristopher Johnson  2223727524230344
..                  ...               ...
236       Matthew Myers  3543676378973965
237        Thomas Brown  4284722681265508
239       Michael Avila  5296068606052842
241          Keith Wong  6011891618747196
242        Dennis Dixon     4375220550950

[157 rows x 2 columns]

In [7]:
#Create me dataFrame for customers who came for Dinner with following information:

* [Payer Name, Tip_per_person]

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3646833725.py, line 3)

In [ ]:
df1 = df[df['time'] == 'Dinner']
df1['tip_per_person'] = np.round(df1['tip']/df1['size'],2)
df1[['Payer Name','tip_per_person']]

# Multiple Conditions

1. &
2. |
3. ~ (NOT operator)

In [ ]:
df[~(df['total_bill'] > 35) & (df['sex']=='Female')]

In [ ]:
df[(df['total_bill'] > 35) | ~(df['sex']=='Female')]

In [ ]:
df[(df['total_bill'] > 35) | (df['sex']!='Female')]

In [ ]:
# weekend

df[(df['day'] == 'Sun') | (df['day'] == 'Sat')]

In [ ]:
# isin

demo_list = ['Thur','Fri']
df[df['day'].isin(demo_list)]